Revit 2027 API
TagOrientation Enumeration
 An enumerated type listing tag orientation options that are supported by IndependentTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TagOrientation
Public Enumeration TagOrientation
public enum class TagOrientation
type TagOrientation
Members
Member name | Value | Description
AnyModelDirection | 2 |  The orientation of tag is Model.
Horizontal | 0 |  The Orientation of tag is Horizontal.
Vertical | 1 |  The Orientation of tag is Vertical.
See Also
Reference
Autodesk.Revit.DB Namespace